In [1]:
import numpy as np
import pandas as pd

In [2]:
np.random.seed(1234)
data1 = np.random.randint(50,size=(6,8))
data1 = pd.DataFrame(data1,index=['A','B','C','D','E','F'],columns=['One','Two','Three','Four','Five','Six','Seven','Eight'])
data1

   One  Two  Three  Four  Five  Six  Seven  Eight
A   47   19     38    12    24   15     49     23
B   41   26     30    43    30   44     26     48
C   28    5     16     9    47   48     12     37
D   34   38      3    39    11    0     41     11
E   16    3      2    19    12    1     11     43
F   17   14      7    42    43   46     28     17

In [14]:
qu = data1.quantile(0.25,1)
#data1.insert(len(data1.columns),"IQR",list(qu),True)
data1['IQR'] = list(qu)
data1

   One  Two  Three  Four  Five  Six  Seven  Eight    IQR
A   47   19     38    12    24   15     49     23  18.00
B   41   26     30    43    30   44     26     48  29.00
C   28    5     16     9    47   48     12     37  11.25
D   34   38      3    39    11    0     41     11   9.00
E   16    3      2    19    12    1     11     43   2.75
F   17   14      7    42    43   46     28     17  16.25

In [5]:
data1_std = data1.std(1)
data1_mean = data1.mean(1)
data1_CV = data1_std/data1_mean
data1.insert(len(data1.columns),"CV",list(data1_CV),True)
data1

   One  Two  Three  Four  Five  Six  Seven  Eight    IQR        CV
A   47   19     38    12    24   15     49     23  18.00  0.510261
B   41   26     30    43    30   44     26     48  29.00  0.245373
C   28    5     16     9    47   48     12     37  11.25  0.707109
D   34   38      3    39    11    0     41     11   9.00  0.818658
E   16    3      2    19    12    1     11     43   2.75  1.090315
F   17   14      7    42    43   46     28     17  16.25  0.571390

In [6]:
data1.insert(len(data1.columns),"mean",list(data1_mean),True)
data1

   One  Two  Three  Four  Five  Six  Seven  Eight    IQR        CV       mean
A   47   19     38    12    24   15     49     23  18.00  0.510261  27.222222
B   41   26     30    43    30   44     26     48  29.00  0.245373  35.222222
C   28    5     16     9    47   48     12     37  11.25  0.707109  23.694444
D   34   38      3    39    11    0     41     11   9.00  0.818658  20.666667
E   16    3      2    19    12    1     11     43   2.75  1.090315  12.194444
F   17   14      7    42    43   46     28     17  16.25  0.571390  25.583333